-- Заполняем данными, фухххх
-- 10 пользователей
MERGE INTO filmorate_user (user_id,
                           user_login,
                           name,
                           birthday, email)
    VALUES (100, 'user1', 'user1', '2001-01-01', 'user1@user1'),
           (200, 'user2', 'user2', '2002-02-02', 'user2@user2'),
           (300, 'user3', 'user3', '2003-03-03', 'user3@user3'),
           (400, 'user4', 'user4', '2004-04-04', 'user4@user4'),
           (500, 'user5', 'user5', '2005-05-05', 'user5@user5'),
           (600, 'user6', 'user6', '2006-06-06', 'user6@user6'),
           (700, 'user7', 'user7', '2007-07-07', 'user7@user7'),
           (800, 'user8', 'user8', '2008-08-08', 'user1@user8'),
           (900, 'user9', 'user9', '2009-09-09', 'user9@user9'),
           (1000, 'user10', 'user10', '2010-10-10', 'user10@user10')
-- ON CONFLICT(user_login) DO UPDATE
-- SET name = EXCLUDED.name, birthday = EXCLUDED.birthday, email = EXCLUDED.email
;

-- Давай дружить!!
MERGE INTO filmorate_friendship (
                                 from_user,
                                 to_user,
                                 status_id)
    VALUES (100, 200, 1),
           (200, 300, 2),
           (300, 400, 2),
           (400, 500, 1),
           (500, 600, 2),
           (600, 700, 2),
           (700, 800, 1),
           (800, 900, 2),
           (900, 1000, 3),
           (1000, 100, 1),
           (100, 300, 1),
           (200, 400, 2),
           (300, 500, 3),
           (400, 600, 1),
           (500, 700, 2),
           (600, 800, 3),
           (700, 900, 2),
           (800, 1000, 2),
           (900, 100, 2),
           (1000, 200, 1),
           (100, 400, 1),
           (200, 500, 2),
           (300, 600, 2),
           (400, 700, 1),
           (500, 800, 2),
           (600, 900, 2),
           (700, 1000, 1),
           (800, 100, 2),
           (900, 200, 3),
           (1000, 300, 1),
           (100, 500, 1),
           (200, 600, 2),
           (300, 700, 3),
           (400, 800, 1),
           (500, 900, 2),
           (600, 1000, 3),
           (700, 100, 1),
           (800, 200, 2),
           (900, 300, 2),
           (1000, 400, 1),
           (100, 600, 1),
           (200, 700, 2),
           (300, 800, 2),
           (400, 900, 1),
           (500, 1000, 2)
--,('user6', 'user1', 3), ('user7', 'user2', 1), ('user8', 'user3', 2), ('user9', 'user4', 3),( 'user10', 'user5', 1)
-- До сих пор не знаю как сделать уникальными пары значений в колонках НЕЗАВИСИМО от порядка.
-- Текущее решение только проверяет в порядке первое и второе значение. так что последняя закоментированная строка
-- спокойно инсертится и хранится. Таким оброзом дублируются статусы отношений. Как бороться не знаю.
-- Можно отфильтовывать на уровне запросов и бизнес логики, но это не гарант.
--Есть решение что по одоговоренности слева (поле from ) будет меньший айдишник.
-- ON CONFLICT(from_user, to_user) DO UPDATE
-- SET status_id = EXCLUDED.status_id
;

-- 10 фильмОв
MERGE INTO filmorate_film (
                           film_id,
                           title,
                           description,
                           release_date,
                           duration_minutes,
                           rating_mpa)
    VALUES (100, 'Фильм 1', 'Описание фильма 1', '1991-01-01', '101', 1),
           (200, 'Фильм 2', 'Описание фильма 2', '1992-02-02', '102', 2),
           (300, 'Фильм 3', 'Описание фильма 3', '1993-03-03', '103', 3),
           (400, 'Фильм 4', 'Описание фильма 4', '1994-04-04', '104', 4),
           (500, 'Фильм 5', 'Описание фильма 5', '1995-05-05', '105', 5),
           (600, 'Фильм 6', 'Описание фильма 6', '1996-06-06', '106', 1),
           (700, 'Фильм 7', 'Описание фильма 7', '1997-07-07', '107', 2),
           (800, 'Фильм 8', 'Описание фильма 8', '1998-08-08', '108', 3),
           (900, 'Фильм 9', 'Описание фильма 9', '1999-09-09', '109', 4),
           (1000, 'Фильм 10', 'Описание фильма 10', '2000-10-10', '110', 5)
-- ON CONFLICT (title,
-- 	description,
-- 	release_date,
-- 	duration_minutes,
-- 	rating_mpa) DO NOTHING
--UPDATE SET title = EXCLUDED.title,
--description = EXCLUDED.description,
--release_date = EXCLUDED.release_date,
--duration_minutes = EXCLUDED.duration_minutes,
--rating_mpa = EXCLUDED.rating_mpa
;
-- Попробуем так сделать. Не знаю сколько "стоит" проверка уникальности всех полей

--Устанавливаем жанры фильмов.
MERGE INTO filmorate_film_genre (
                                 genre_id,
                                 film_id)
    VALUES (1, 100),
           (2, 200),
           (3, 300),
           (4, 400),
           (5, 500),
           (1, 600),
           (2, 700),
           (3, 800),
           (4, 900),
           (5, 1000),
           (1, 300),
           (2, 400),
           (3, 500),
           (4, 600),
           (5, 700)
;
-- В этой таблице конфликтов быть не должно, всего два поля и если мы
--добавляем дубль
-- то это мы где то запуталсись и само будет проверенно

--Ставим лайки
MERGE INTO filmorate_like (
                           film_id,
                           user_id
    ) VALUES (100, 100),
             (200, 200),
             (300, 300),
             (400, 400),
             (500, 500),
             (100, 600),
             (200, 700),
             (300, 800),
             (400, 900),
             (500, 1000),
             (600, 100),
             (700, 200),
             (800, 300),
             (900, 400),
             (1000, 500),
             (600, 600),
             (200, 800),
             (300, 900),
             (300, 1000),
             (500, 100)
-- ON CONFLICT(film_id, user_login ) DO NOTHING
; -- В этой таблице тоже будут ошибки только если мы ставим второй лайк. Сделаю запись уникальной на всякий.

